function [a] = somActivation(pattern, neighborDist)
%υπολογισμός της ενεργοποίησης ενός SOM
%neighborDist: η απόσταση (στο πλέγμα του SOM) εντός της οποίας εάν βρίσκεται ένας 
%νευρώνας θεωρείται γειτονικός του νευρώνα νικητή (είναι νούμερο)
%a:πίνακας Nx1 που συνίσταται από τις τιμές των ενεργοποιήσεων όλων των νευρώνων ενός SOM

% Η παραπάνω συνάρτηση υπολογίζει τις ενεργοποιήσεις όλων των νευρώνων του SOM ως εξής:
% Ο νευρώνας νικητής λαμβάνει τιμή ενεργοποίησης 1, οι νευρώνες που θεωρούνται γειτονικοί 
% σε αυτόν (δηλαδή αυτοί που βρίσκονται σε απόσταση <= neighborDist) λαμβάνουν τιμη 0.5 
% και όλοι οι υπόλοιποι νευρώνες έχουν τιμή ενεργοποίησης 0.
% Ν συνολικό πλήθος των νευρώνων
% distances: πίνακας NxN που περιέχει την απόσταση κάθε νευρώνα από τους λοιπούς νευρώνες

global N distances;

a = zeros(N,1);
output = (somOutput(pattern)); % η πρώτη συνάρτηση που γράψαμε αποφαίνεται για τον νικητή
winner = find(output); % βρίσκει το μη μηδενικό στοιχείο (είναι μόνο ένα)
for i=1:N
    if distances(winner,i) <= neighborDist %απόσταση winner από i-οστό νευρώνα
        a(i) = 0.5;
    end
end    
a(winner) = 1;