function [output] = somOutput(pattern)
% υπολογισμός της εξόδου ενός SOM

% pattern: πίνακας Dx1 που περιέχει διατεταγμένα τα χαρακτηριστικά ενός προτύπου εισόδου 
% D διαστάσεις προτύπων, αριθμός χαρακτηριστικών εισόδου
% IW:οι παράμετροι/βάρη του SOM είναι ένας πίνακας μεγέθους NxD, 
% κάθε στοιχείο της γραμμής του οποίου αρχικοποιείται σε μία τυχαία τιμή μεταξύ 
% της μέγιστης και ελάχιστης τιμής του αντίστοιχου χαρακτηριστικού εισόδου.

% negdist: υπολογίζει την αρνητική Ευκλείδεια απόσταση μεταξύ του προτύπου εισόδου και 
% του διανύσματος παραμέτρων κάθε νευρώνα του SOM, z = -sqrt(sum(w-p)^2)

% compet: βρίσκει τον νευρώνα με τη μεγαλύτερη τιμή και θέτει την έξοδο του στο 1.

% output πίνακας Nx1 που περιέχει το σύνολο των εξόδων του SOM, οι τιμές
% των εξόδων ενός SOM είναι όλες 0 εκτός της τιμής του κόμβου νικητή που είναι 1.

global IW;

[output] = compet(negdist(IW, pattern));